app/controllers/users_controller.rb

  def update
    @user = User.find(params[:id])
    if @user.update_attributes(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "users" SET "name" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "Olli H"], ["password_digest", "$2a$10$X960xn8/0jkHP/KvSUXE/uwDvZbp3Q18oUlqjbwgJbqH7qijxEzm2"], ["updated_at", "2015-09-02 15:34:33.907150"], ["id", 3]]